# WPerMSup2K Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..WPerMSup2K Property
SymbolTypeId Class See Also
---
Symbol W/(m²·K), indicating unit Watts per square meter kelvin.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId WPerMSup2K { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WPerMSup2K As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WPerMSup2K {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace